**Лицензия на использование кода и изображений**  
=========================================================================================

1. **Общие положения**  
   Код предоставляется на условиях лицензии "как есть" ("as is").  
   Я не несу ответственности за любые убытки или ущерб, которые могут возникнуть в результате использования данного кода.  

2. **Использование кода**  
   Код может быть использован, модифицирован и распространяем для любых целей, при условии сохранения данной лицензии в каждом экземпляре.  

3. **Авторские права на изображения**  
   Все изображения, включенные в данный проект, защищены моими авторскими правами.  
   Использование изображений допускается только с моего прямого разрешения.  

4. **Отсутствие гарантий**  
   Код предоставляется без каких-либо гарантий, явных или подразумеваемых, включая, но не ограничиваясь, гарантии товарной пригодности или пригодности для конкретной цели.  
